Tekla.Structures.Internal.dotPoint_t
Struct for the Point.

Tekla.Structures.Internal.dotPoint_t.X
The points coordinates.

Tekla.Structures.Internal.dotPoint_t.Y
The points coordinates.

Tekla.Structures.Internal.dotPoint_t.Z
The points coordinates.

Tekla.Structures.Internal.dotPoint_t.#ctor(Tekla.Structures.Geometry3d.Point)
Construct point from point.
point:

Tekla.Structures.Internal.dotPoint_t.ToStruct(Tekla.Structures.Geometry3d.Point)
Point to dotPoint_t.
point:

Tekla.Structures.Internal.dotPoint_t.FromStruct(Tekla.Structures.Geometry3d.Point)
dotPoint to Point.
point:

Tekla.Structures.Internal.dotPoint_t.ToString
Returns the string presentation.
Returns: The string.

Tekla.Structures.Internal.dotPoint_t.Equals(Tekla.Structures.Internal.dotPoint_t)
Check equality.
point:
Returns:

Tekla.Structures.Internal.dotPoint_t.Equals(System.Object)
Check equality.
obj:
Returns:

Tekla.Structures.Internal.dotPoint_t.GetHashCode
Get the hashcode.
Returns: